import { ArticleCard } from "~/components/ArticleCard";

export default function Index() {
  return (
    <>
      <h1 className="text-2xl bold">たちばなゆうとのブログ</h1>

      <div className="flex flex-wrap gap-12 justify-center mt-20">
        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="hoge"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="hoge"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="hoge"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="hoge"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="hoge"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="hoge"
        />
      </div>
    </>
  );
}
