import { ArticleCard } from "~/components/ArticleCard";

export default function Index() {
  return (
    <>
      <div className="flex flex-wrap gap-12 justify-center">
        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="articles/1"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="articles/1"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="articles/1"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="articles/1"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="articles/1"
        />

        <ArticleCard
          title="マシュマロって最近食べてないよね"
          body="甘すぎるからあんまり欲しくならないし、そもそもコンビニとかで見かけない。手軽に食べられうようなマシュマロが開発されていないだけかも。マシュマロっぽい手軽に食べられる何かは売られているけど、あれはマシュマロって感じでもないしなぁ。"
          src="articles/1"
        />
      </div>
    </>
  );
}
